---
kind: other
id: Properties.T:Autodesk.Revit.DB.FillPatternElement
source: html/e3dbae88-4b28-50fa-c73d-4985bc438f36.htm
---
# FillPatternElement Properties

The id of the assembly instance to which the element belongs.